In [28]:
import pandas as pd
import seaborn as sns
df= sns.load_dataset('titanic')
df

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0           0       3    male  22.0  ...   NaN  Southampton     no  False
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
2           1       3  female  26.0  ...   NaN  Southampton    yes   True
3           1       1  female  35.0  ...     C  Southampton    yes  False
4           0       3    male  35.0  ...   NaN  Southampton     no   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[891 rows x 15 columns]

* 분류형 변수-> 후보군
* pclass, sex, sibsp, parch, embarked, class, who, adult_male, 
embark_town, alone

In [32]:
X= df[['fare', 'pclass']]
Y= df[['survived']]
X.shape, Y.shape

((891, 2), (891, 1))

In [33]:
from sklearn.preprocessing import StandardScaler
scaler= StandardScaler()
scaler.fit(X)
X= scaler.transform(X)
X.shape

(891, 2)

In [37]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test= train_test_split(X, Y)

In [38]:
from sklearn.linear_model import LogisticRegression
logR= LogisticRegression()
logR= scaler.fit(x_train, y_train)

In [39]:
logR.score(x_train, y_train)

AttributeError: ignored